gcolombo-mchp/hal_microchip/packs/pic32c/pic32ck_sg_gc/common/eth_pic32ck_sg_gc.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file eth_pic32ck_sg_gc.h
 * @brief GMAC-to-ETH Register and Bit Mask Mapping for PIC32CK SG/GC family.
 *
 * This file maps the GMAC register names used by Zephyr's eth_sam_gmac.c driver
 * to the ETH register names defined in the PIC32CK SG/GC ATDF-generated HAL
 * headers.  The PIC32CK ETH peripheral is register-compatible with the SAM GMAC
 * but uses a different naming prefix (ETH_ instead of GMAC_) and direct uint32_t
 * members instead of the SAM0 union-of-structs (.reg) access style.
 */

#ifndef MICROCHIP_COMMON_ETH_PIC32CK_SG_GC_H_
#define MICROCHIP_COMMON_ETH_PIC32CK_SG_GC_H_

/* ========================================================================== */
/* Type alias: map Gmac* (used by the driver) to eth_registers_t              */
/* ========================================================================== */
typedef eth_registers_t Gmac;

/* ========================================================================== */
/* Register member name mappings                                              */
/* Usage: gmac->GMAC_NCR expands to gmac->ETH_NCR                            */
/* ========================================================================== */
#define GMAC_NCR        ETH_NCR
#define GMAC_NCFGR      ETH_NCFGR
#define GMAC_NSR        ETH_NSR
#define GMAC_UR         ETH_UR
#define GMAC_DCFGR      ETH_DCFGR
#define GMAC_TSR        ETH_TSR
#define GMAC_RBQB       ETH_RBQB
#define GMAC_TBQB       ETH_TBQB
#define GMAC_RSR        ETH_RSR
#define GMAC_ISR        ETH_ISR
#define GMAC_IER        ETH_IER
#define GMAC_IDR        ETH_IDR
#define GMAC_IMR        ETH_IMR
#define GMAC_MAN        ETH_MAN
#define GMAC_RPQ        ETH_RPQ
#define GMAC_TPQ        ETH_TPQ
#define GMAC_TPSF       ETH_TPSF
#define GMAC_RPSF       ETH_RPSF
#define GMAC_RJFML      ETH_RJFML
#define GMAC_HRB        ETH_HRB
#define GMAC_HRT        ETH_HRT
#define GMAC_WOL        ETH_WOL
#define GMAC_IPGS       ETH_IPGS
#define GMAC_SVLAN      ETH_SVLAN
#define GMAC_TPFCP      ETH_TPFCP
#define GMAC_SAMB1      ETH_SAMB1
#define GMAC_SAMT1      ETH_SAMT1
#define GMAC_NSC        ETH_NSC
#define GMAC_SCL        ETH_SCL
#define GMAC_SCH        ETH_SCH
#define GMAC_EFTSH      ETH_EFTSH
#define GMAC_EFRSH      ETH_EFRSH
#define GMAC_PEFTSH     ETH_PEFTSH
#define GMAC_PEFRSH     ETH_PEFRSH
#define GMAC_OTLO       ETH_OTLO
#define GMAC_OTHI       ETH_OTHI
#define GMAC_FT         ETH_FT
#define GMAC_BCFT       ETH_BCFT
#define GMAC_MFT        ETH_MFT
#define GMAC_PFT        ETH_PFT
#define GMAC_BFT64      ETH_BFT64
#define GMAC_TBFT127    ETH_TBFT127
#define GMAC_TBFT255    ETH_TBFT255
#define GMAC_TBFT511    ETH_TBFT511
#define GMAC_TBFT1023   ETH_TBFT1023
#define GMAC_TBFT1518   ETH_TBFT1518
#define GMAC_GTBFT1518  ETH_GTBFT1518
#define GMAC_TUR        ETH_TUR
#define GMAC_SCF        ETH_SCF
#define GMAC_MCF        ETH_MCF
#define GMAC_EC         ETH_EC
#define GMAC_LC         ETH_LC
#define GMAC_DTF        ETH_DTF
#define GMAC_CSE        ETH_CSE
#define GMAC_ORLO       ETH_ORLO
#define GMAC_ORHI       ETH_ORHI
#define GMAC_FR         ETH_FR
#define GMAC_BCFR       ETH_BCFR
#define GMAC_MFR        ETH_MFR
#define GMAC_PFR        ETH_PFR
#define GMAC_BFR64      ETH_BFR64
#define GMAC_TBFR127    ETH_TBFR127
#define GMAC_TBFR255    ETH_TBFR255
#define GMAC_TBFR511    ETH_TBFR511
#define GMAC_TBFR1023   ETH_TBFR1023
#define GMAC_TBFR1518   ETH_TBFR1518
#define GMAC_TMXBFR     ETH_TMXBFR
#define GMAC_UFR        ETH_UFR
#define GMAC_OFR        ETH_OFR
#define GMAC_JR         ETH_JR
#define GMAC_FCSE       ETH_FCSE
#define GMAC_LFFE       ETH_LFFE
#define GMAC_RSE        ETH_RSE
#define GMAC_AE         ETH_AE
#define GMAC_RRE        ETH_RRE
#define GMAC_ROE        ETH_ROE
#define GMAC_IHCE       ETH_IHCE
#define GMAC_TCE        ETH_TCE
#define GMAC_UCE        ETH_UCE
#define GMAC_TISUBN     ETH_TISUBN
#define GMAC_TSH        ETH_TSH
#define GMAC_TSSSL      ETH_TSSSL
#define GMAC_TSSN       ETH_TSSN
#define GMAC_TSL        ETH_TSL
#define GMAC_TN         ETH_TN
#define GMAC_TA         ETH_TA
#define GMAC_TI         ETH_TI
#define GMAC_EFTSL      ETH_EFTSL
#define GMAC_EFTN       ETH_EFTN
#define GMAC_EFRSL      ETH_EFRSL
#define GMAC_EFRN       ETH_EFRN
#define GMAC_PEFTSL     ETH_PEFTSL
#define GMAC_PEFTN      ETH_PEFTN
#define GMAC_PEFRSL     ETH_PEFRSL
#define GMAC_PEFRN      ETH_PEFRN
#define GMAC_RLPITR     ETH_RLPITR
#define GMAC_RLPITI     ETH_RLPITI
#define GMAC_TLPITR     ETH_TLPITR
#define GMAC_TLPITI     ETH_TLPITI

/* ========================================================================== */
/* Specific Address (SA) array and member mappings                            */
/* ========================================================================== */
#define GMAC_SA         SA
#define GMAC_SAB        ETH_SAB
#define GMAC_SAT        ETH_SAT

/* ========================================================================== */
/* NCR - Network Control Register bit masks and positions                     */
/* ========================================================================== */
#define GMAC_NCR_LBL_Pos         ETH_NCR_LBL_Pos
#define GMAC_NCR_LBL_Msk         ETH_NCR_LBL_Msk
#define GMAC_NCR_LBL             ETH_NCR_LBL_Msk

#define GMAC_NCR_RXEN_Pos        ETH_NCR_RXEN_Pos
#define GMAC_NCR_RXEN_Msk        ETH_NCR_RXEN_Msk
#define GMAC_NCR_RXEN            ETH_NCR_RXEN_Msk

#define GMAC_NCR_TXEN_Pos        ETH_NCR_TXEN_Pos
#define GMAC_NCR_TXEN_Msk        ETH_NCR_TXEN_Msk
#define GMAC_NCR_TXEN            ETH_NCR_TXEN_Msk

#define GMAC_NCR_MPE_Pos         ETH_NCR_MPE_Pos
#define GMAC_NCR_MPE_Msk         ETH_NCR_MPE_Msk
#define GMAC_NCR_MPE             ETH_NCR_MPE_Msk

#define GMAC_NCR_CLRSTAT_Pos     ETH_NCR_CLRSTAT_Pos
#define GMAC_NCR_CLRSTAT_Msk     ETH_NCR_CLRSTAT_Msk
#define GMAC_NCR_CLRSTAT         ETH_NCR_CLRSTAT_Msk

#define GMAC_NCR_INCSTAT_Pos     ETH_NCR_INCSTAT_Pos
#define GMAC_NCR_INCSTAT_Msk     ETH_NCR_INCSTAT_Msk
#define GMAC_NCR_INCSTAT         ETH_NCR_INCSTAT_Msk

