gcolombo-mchp/hal_microchip/packs/pic32c/pic32ck_sg_gc/common/eth_pic32ck_sg_gc.h
#define GMAC_NCR_WESTAT_Pos      ETH_NCR_WESTAT_Pos
#define GMAC_NCR_WESTAT_Msk      ETH_NCR_WESTAT_Msk
#define GMAC_NCR_WESTAT          ETH_NCR_WESTAT_Msk

#define GMAC_NCR_BP_Pos          ETH_NCR_BP_Pos
#define GMAC_NCR_BP_Msk          ETH_NCR_BP_Msk
#define GMAC_NCR_BP              ETH_NCR_BP_Msk

#define GMAC_NCR_TSTART_Pos      ETH_NCR_TSTART_Pos
#define GMAC_NCR_TSTART_Msk      ETH_NCR_TSTART_Msk
#define GMAC_NCR_TSTART          ETH_NCR_TSTART_Msk

#define GMAC_NCR_THALT_Pos       ETH_NCR_THALT_Pos
#define GMAC_NCR_THALT_Msk       ETH_NCR_THALT_Msk
#define GMAC_NCR_THALT           ETH_NCR_THALT_Msk

#define GMAC_NCR_TXPF_Pos        ETH_NCR_TXPF_Pos
#define GMAC_NCR_TXPF_Msk        ETH_NCR_TXPF_Msk
#define GMAC_NCR_TXPF            ETH_NCR_TXPF_Msk

#define GMAC_NCR_TXZQPF_Pos     ETH_NCR_TXZQPF_Pos
#define GMAC_NCR_TXZQPF_Msk     ETH_NCR_TXZQPF_Msk
#define GMAC_NCR_TXZQPF          ETH_NCR_TXZQPF_Msk

#define GMAC_NCR_SRTSM_Pos      ETH_NCR_SRTSM_Pos
#define GMAC_NCR_SRTSM_Msk      ETH_NCR_SRTSM_Msk
#define GMAC_NCR_SRTSM           ETH_NCR_SRTSM_Msk

/* ========================================================================== */
/* NCFGR - Network Configuration Register bit masks and positions             */
/* ========================================================================== */
#define GMAC_NCFGR_SPD_Pos       ETH_NCFGR_SPD_Pos
#define GMAC_NCFGR_SPD_Msk       ETH_NCFGR_SPD_Msk
#define GMAC_NCFGR_SPD           ETH_NCFGR_SPD_Msk

#define GMAC_NCFGR_FD_Pos        ETH_NCFGR_FD_Pos
#define GMAC_NCFGR_FD_Msk        ETH_NCFGR_FD_Msk
#define GMAC_NCFGR_FD            ETH_NCFGR_FD_Msk

#define GMAC_NCFGR_DNVLAN_Pos    ETH_NCFGR_DNVLAN_Pos
#define GMAC_NCFGR_DNVLAN_Msk    ETH_NCFGR_DNVLAN_Msk
#define GMAC_NCFGR_DNVLAN        ETH_NCFGR_DNVLAN_Msk

#define GMAC_NCFGR_JFRAME_Pos    ETH_NCFGR_JFRAME_Pos
#define GMAC_NCFGR_JFRAME_Msk    ETH_NCFGR_JFRAME_Msk
#define GMAC_NCFGR_JFRAME        ETH_NCFGR_JFRAME_Msk

#define GMAC_NCFGR_CAF_Pos       ETH_NCFGR_CAF_Pos
#define GMAC_NCFGR_CAF_Msk       ETH_NCFGR_CAF_Msk
#define GMAC_NCFGR_CAF           ETH_NCFGR_CAF_Msk

#define GMAC_NCFGR_NBC_Pos       ETH_NCFGR_NBC_Pos
#define GMAC_NCFGR_NBC_Msk       ETH_NCFGR_NBC_Msk
#define GMAC_NCFGR_NBC           ETH_NCFGR_NBC_Msk

#define GMAC_NCFGR_MTIHEN_Pos    ETH_NCFGR_MTIHEN_Pos
#define GMAC_NCFGR_MTIHEN_Msk    ETH_NCFGR_MTIHEN_Msk
#define GMAC_NCFGR_MTIHEN        ETH_NCFGR_MTIHEN_Msk

#define GMAC_NCFGR_UNIHEN_Pos    ETH_NCFGR_UNIHEN_Pos
#define GMAC_NCFGR_UNIHEN_Msk    ETH_NCFGR_UNIHEN_Msk
#define GMAC_NCFGR_UNIHEN        ETH_NCFGR_UNIHEN_Msk

#define GMAC_NCFGR_MAXFS_Pos     ETH_NCFGR_MAXFS_Pos
#define GMAC_NCFGR_MAXFS_Msk     ETH_NCFGR_MAXFS_Msk
#define GMAC_NCFGR_MAXFS         ETH_NCFGR_MAXFS_Msk

/* GBE in SAM maps to GIGE in PIC32CK */
#define GMAC_NCFGR_GBE_Pos       ETH_NCFGR_GIGE_Pos
#define GMAC_NCFGR_GBE_Msk       ETH_NCFGR_GIGE_Msk
#define GMAC_NCFGR_GBE           ETH_NCFGR_GIGE_Msk

#define GMAC_NCFGR_RTY_Pos       ETH_NCFGR_RTY_Pos
#define GMAC_NCFGR_RTY_Msk       ETH_NCFGR_RTY_Msk
#define GMAC_NCFGR_RTY           ETH_NCFGR_RTY_Msk

#define GMAC_NCFGR_PEN_Pos       ETH_NCFGR_PEN_Pos
#define GMAC_NCFGR_PEN_Msk       ETH_NCFGR_PEN_Msk
#define GMAC_NCFGR_PEN           ETH_NCFGR_PEN_Msk

#define GMAC_NCFGR_RXBUFO_Pos    ETH_NCFGR_RXBUFO_Pos
#define GMAC_NCFGR_RXBUFO_Msk    ETH_NCFGR_RXBUFO_Msk
#define GMAC_NCFGR_RXBUFO(value) ETH_NCFGR_RXBUFO(value)

#define GMAC_NCFGR_LFERD_Pos     ETH_NCFGR_LFERD_Pos
#define GMAC_NCFGR_LFERD_Msk     ETH_NCFGR_LFERD_Msk
#define GMAC_NCFGR_LFERD         ETH_NCFGR_LFERD_Msk

#define GMAC_NCFGR_RFCS_Pos      ETH_NCFGR_RFCS_Pos
#define GMAC_NCFGR_RFCS_Msk      ETH_NCFGR_RFCS_Msk
#define GMAC_NCFGR_RFCS          ETH_NCFGR_RFCS_Msk

#define GMAC_NCFGR_CLK_Pos       ETH_NCFGR_CLK_Pos
#define GMAC_NCFGR_CLK_Msk       ETH_NCFGR_CLK_Msk
#define GMAC_NCFGR_CLK(value)    ETH_NCFGR_CLK(value)

#define GMAC_NCFGR_DBW_Pos       ETH_NCFGR_DBW_Pos
#define GMAC_NCFGR_DBW_Msk       ETH_NCFGR_DBW_Msk
#define GMAC_NCFGR_DBW(value)    ETH_NCFGR_DBW(value)

#define GMAC_NCFGR_DCPF_Pos      ETH_NCFGR_DCPF_Pos
#define GMAC_NCFGR_DCPF_Msk      ETH_NCFGR_DCPF_Msk
#define GMAC_NCFGR_DCPF          ETH_NCFGR_DCPF_Msk

#define GMAC_NCFGR_RXCOEN_Pos    ETH_NCFGR_RXCOEN_Pos
#define GMAC_NCFGR_RXCOEN_Msk    ETH_NCFGR_RXCOEN_Msk
#define GMAC_NCFGR_RXCOEN        ETH_NCFGR_RXCOEN_Msk

#define GMAC_NCFGR_EFRHD_Pos     ETH_NCFGR_EFRHD_Pos
#define GMAC_NCFGR_EFRHD_Msk     ETH_NCFGR_EFRHD_Msk
#define GMAC_NCFGR_EFRHD         ETH_NCFGR_EFRHD_Msk

#define GMAC_NCFGR_IRXFCS_Pos    ETH_NCFGR_IRXFCS_Pos
#define GMAC_NCFGR_IRXFCS_Msk    ETH_NCFGR_IRXFCS_Msk
#define GMAC_NCFGR_IRXFCS        ETH_NCFGR_IRXFCS_Msk

#define GMAC_NCFGR_IPGSEN_Pos    ETH_NCFGR_IPGSEN_Pos
#define GMAC_NCFGR_IPGSEN_Msk    ETH_NCFGR_IPGSEN_Msk
#define GMAC_NCFGR_IPGSEN        ETH_NCFGR_IPGSEN_Msk

#define GMAC_NCFGR_RXBP_Pos      ETH_NCFGR_RXBP_Pos
#define GMAC_NCFGR_RXBP_Msk      ETH_NCFGR_RXBP_Msk
#define GMAC_NCFGR_RXBP          ETH_NCFGR_RXBP_Msk

#define GMAC_NCFGR_IRXER_Pos     ETH_NCFGR_IRXER_Pos
#define GMAC_NCFGR_IRXER_Msk     ETH_NCFGR_IRXER_Msk
#define GMAC_NCFGR_IRXER         ETH_NCFGR_IRXER_Msk

/* ========================================================================== */
/* NSR - Network Status Register bit masks                                    */
/* ========================================================================== */
#define GMAC_NSR_MDIO_Pos        ETH_NSR_MDIO_Pos
#define GMAC_NSR_MDIO_Msk        ETH_NSR_MDIO_Msk
#define GMAC_NSR_MDIO            ETH_NSR_MDIO_Msk

#define GMAC_NSR_IDLE_Pos        ETH_NSR_IDLE_Pos
#define GMAC_NSR_IDLE_Msk        ETH_NSR_IDLE_Msk
#define GMAC_NSR_IDLE            ETH_NSR_IDLE_Msk

/* ========================================================================== */
/* UR - User Register bit masks                                               */
/* ========================================================================== */
#define GMAC_UR_UO_Pos           ETH_UR_UO_Pos
#define GMAC_UR_UO_Msk           ETH_UR_UO_Msk
#define GMAC_UR_UI_Pos           ETH_UR_UI_Pos
#define GMAC_UR_UI_Msk           ETH_UR_UI_Msk

