gcolombo-mchp/hal_microchip/packs/pic32c/pic32ck_sg_gc/common/eth_pic32ck_sg_gc.h
/*
 * The SAM GMAC UR register uses MII/RMII selection bits.
 * PIC32CK ETH_UR has a generic user-programmable field.
 * Map MII to bit 0 of UO for PHY interface selection.
 */
#define GMAC_UR_MII_Pos          ETH_UR_UO_Pos
#define GMAC_UR_MII_Msk          (_UINT32_(0x1) << GMAC_UR_MII_Pos)
#define GMAC_UR_MII              GMAC_UR_MII_Msk

/* ========================================================================== */
/* DCFGR - DMA Configuration Register bit masks and positions                 */
/* ========================================================================== */
#define GMAC_DCFGR_FBLDO_Pos     ETH_DCFGR_FBLDO_Pos
#define GMAC_DCFGR_FBLDO_Msk     ETH_DCFGR_FBLDO_Msk
#define GMAC_DCFGR_FBLDO(value)  ETH_DCFGR_FBLDO(value)

#define GMAC_DCFGR_ESMA_Pos      ETH_DCFGR_ESMA_Pos
#define GMAC_DCFGR_ESMA_Msk      ETH_DCFGR_ESMA_Msk
#define GMAC_DCFGR_ESMA          ETH_DCFGR_ESMA_Msk

#define GMAC_DCFGR_ESPA_Pos      ETH_DCFGR_ESPA_Pos
#define GMAC_DCFGR_ESPA_Msk      ETH_DCFGR_ESPA_Msk
#define GMAC_DCFGR_ESPA          ETH_DCFGR_ESPA_Msk

#define GMAC_DCFGR_RXBMS_Pos     ETH_DCFGR_RXBMS_Pos
#define GMAC_DCFGR_RXBMS_Msk     ETH_DCFGR_RXBMS_Msk
#define GMAC_DCFGR_RXBMS(value)  ETH_DCFGR_RXBMS(value)
#define GMAC_DCFGR_RXBMS_FULL    ETH_DCFGR_RXBMS(0x3)

#define GMAC_DCFGR_TXPBMS_Pos    ETH_DCFGR_TXPBMS_Pos
#define GMAC_DCFGR_TXPBMS_Msk    ETH_DCFGR_TXPBMS_Msk
#define GMAC_DCFGR_TXPBMS        ETH_DCFGR_TXPBMS_Msk

#define GMAC_DCFGR_TXCOEN_Pos    ETH_DCFGR_TXCOEN_Pos
#define GMAC_DCFGR_TXCOEN_Msk    ETH_DCFGR_TXCOEN_Msk
#define GMAC_DCFGR_TXCOEN        ETH_DCFGR_TXCOEN_Msk

#define GMAC_DCFGR_DRBS_Pos      ETH_DCFGR_DRBS_Pos
#define GMAC_DCFGR_DRBS_Msk      ETH_DCFGR_DRBS_Msk
#define GMAC_DCFGR_DRBS(value)   ETH_DCFGR_DRBS(value)

#define GMAC_DCFGR_DDRP_Pos      ETH_DCFGR_DDRP_Pos
#define GMAC_DCFGR_DDRP_Msk      ETH_DCFGR_DDRP_Msk
#define GMAC_DCFGR_DDRP          ETH_DCFGR_DDRP_Msk

/* ========================================================================== */
/* TSR - Transmit Status Register bit masks                                   */
/* ========================================================================== */
#define GMAC_TSR_UBR_Pos         ETH_TSR_UBR_Pos
#define GMAC_TSR_UBR_Msk         ETH_TSR_UBR_Msk
#define GMAC_TSR_UBR             ETH_TSR_UBR_Msk

#define GMAC_TSR_COL_Pos         ETH_TSR_COL_Pos
#define GMAC_TSR_COL_Msk         ETH_TSR_COL_Msk
#define GMAC_TSR_COL             ETH_TSR_COL_Msk

#define GMAC_TSR_RLE_Pos         ETH_TSR_RLE_Pos
#define GMAC_TSR_RLE_Msk         ETH_TSR_RLE_Msk
#define GMAC_TSR_RLE             ETH_TSR_RLE_Msk

#define GMAC_TSR_TXGO_Pos        ETH_TSR_TXGO_Pos
#define GMAC_TSR_TXGO_Msk        ETH_TSR_TXGO_Msk
#define GMAC_TSR_TXGO            ETH_TSR_TXGO_Msk

#define GMAC_TSR_TFC_Pos         ETH_TSR_TFC_Pos
#define GMAC_TSR_TFC_Msk         ETH_TSR_TFC_Msk
#define GMAC_TSR_TFC             ETH_TSR_TFC_Msk

#define GMAC_TSR_TXCOMP_Pos      ETH_TSR_TXCOMP_Pos
#define GMAC_TSR_TXCOMP_Msk      ETH_TSR_TXCOMP_Msk
#define GMAC_TSR_TXCOMP          ETH_TSR_TXCOMP_Msk

#define GMAC_TSR_UND_Pos         ETH_TSR_UND_Pos
#define GMAC_TSR_UND_Msk         ETH_TSR_UND_Msk
#define GMAC_TSR_UND             ETH_TSR_UND_Msk

#define GMAC_TSR_HRESP_Pos       ETH_TSR_HRESP_Pos
#define GMAC_TSR_HRESP_Msk       ETH_TSR_HRESP_Msk
#define GMAC_TSR_HRESP           ETH_TSR_HRESP_Msk

/* ========================================================================== */
/* RBQB / TBQB - Buffer Queue Base Address Register masks                     */
/* ========================================================================== */
#define GMAC_RBQB_ADDR_Pos       ETH_RBQB_ADDR_Pos
#define GMAC_RBQB_ADDR_Msk       ETH_RBQB_ADDR_Msk

#define GMAC_TBQB_ADDR_Pos       ETH_TBQB_ADDR_Pos
#define GMAC_TBQB_ADDR_Msk       ETH_TBQB_ADDR_Msk

/* ========================================================================== */
/* RSR - Receive Status Register bit masks                                    */
/* ========================================================================== */
#define GMAC_RSR_BNA_Pos         ETH_RSR_BNA_Pos
#define GMAC_RSR_BNA_Msk         ETH_RSR_BNA_Msk
#define GMAC_RSR_BNA             ETH_RSR_BNA_Msk

#define GMAC_RSR_REC_Pos         ETH_RSR_REC_Pos
#define GMAC_RSR_REC_Msk         ETH_RSR_REC_Msk
#define GMAC_RSR_REC             ETH_RSR_REC_Msk

#define GMAC_RSR_RXOVR_Pos       ETH_RSR_RXOVR_Pos
#define GMAC_RSR_RXOVR_Msk       ETH_RSR_RXOVR_Msk
#define GMAC_RSR_RXOVR           ETH_RSR_RXOVR_Msk

#define GMAC_RSR_HNO_Pos         ETH_RSR_HNO_Pos
#define GMAC_RSR_HNO_Msk         ETH_RSR_HNO_Msk
#define GMAC_RSR_HNO             ETH_RSR_HNO_Msk

/* ========================================================================== */
/* ISR - Interrupt Status Register bit masks                                  */
/* ========================================================================== */
#define GMAC_ISR_MFS_Pos         ETH_ISR_MFS_Pos
#define GMAC_ISR_MFS_Msk         ETH_ISR_MFS_Msk
#define GMAC_ISR_MFS             ETH_ISR_MFS_Msk

#define GMAC_ISR_RCOMP_Pos       ETH_ISR_RCOMP_Pos
#define GMAC_ISR_RCOMP_Msk       ETH_ISR_RCOMP_Msk
#define GMAC_ISR_RCOMP           ETH_ISR_RCOMP_Msk

#define GMAC_ISR_RXUBR_Pos       ETH_ISR_RXUBR_Pos
#define GMAC_ISR_RXUBR_Msk       ETH_ISR_RXUBR_Msk
#define GMAC_ISR_RXUBR           ETH_ISR_RXUBR_Msk

#define GMAC_ISR_TXUBR_Pos       ETH_ISR_TXUBR_Pos
#define GMAC_ISR_TXUBR_Msk       ETH_ISR_TXUBR_Msk
#define GMAC_ISR_TXUBR           ETH_ISR_TXUBR_Msk

#define GMAC_ISR_TUR_Pos         ETH_ISR_TUR_Pos
#define GMAC_ISR_TUR_Msk         ETH_ISR_TUR_Msk
#define GMAC_ISR_TUR             ETH_ISR_TUR_Msk

#define GMAC_ISR_RLEX_Pos        ETH_ISR_RLEX_Pos
#define GMAC_ISR_RLEX_Msk        ETH_ISR_RLEX_Msk
#define GMAC_ISR_RLEX            ETH_ISR_RLEX_Msk

#define GMAC_ISR_TFC_Pos         ETH_ISR_TFC_Pos
#define GMAC_ISR_TFC_Msk         ETH_ISR_TFC_Msk
#define GMAC_ISR_TFC             ETH_ISR_TFC_Msk

#define GMAC_ISR_TCOMP_Pos       ETH_ISR_TCOMP_Pos
#define GMAC_ISR_TCOMP_Msk       ETH_ISR_TCOMP_Msk
#define GMAC_ISR_TCOMP           ETH_ISR_TCOMP_Msk

#define GMAC_ISR_ROVR_Pos        ETH_ISR_ROVR_Pos
#define GMAC_ISR_ROVR_Msk        ETH_ISR_ROVR_Msk
#define GMAC_ISR_ROVR            ETH_ISR_ROVR_Msk

#define GMAC_ISR_HRESP_Pos       ETH_ISR_HRESP_Pos
#define GMAC_ISR_HRESP_Msk       ETH_ISR_HRESP_Msk
#define GMAC_ISR_HRESP           ETH_ISR_HRESP_Msk

#define GMAC_ISR_PFNZ_Pos        ETH_ISR_PFNZ_Pos
#define GMAC_ISR_PFNZ_Msk        ETH_ISR_PFNZ_Msk
#define GMAC_ISR_PFNZ            ETH_ISR_PFNZ_Msk

