gcolombo-mchp/hal_microchip/packs/pic32c/pic32ck_sg_gc/common/eth_pic32ck_sg_gc.h
#define GMAC_ISR_PTZ_Pos         ETH_ISR_PTZ_Pos
#define GMAC_ISR_PTZ_Msk         ETH_ISR_PTZ_Msk
#define GMAC_ISR_PTZ             ETH_ISR_PTZ_Msk

#define GMAC_ISR_PFTR_Pos        ETH_ISR_PFTR_Pos
#define GMAC_ISR_PFTR_Msk        ETH_ISR_PFTR_Msk
#define GMAC_ISR_PFTR            ETH_ISR_PFTR_Msk

#define GMAC_ISR_DRQFR_Pos       ETH_ISR_DRQFR_Pos
#define GMAC_ISR_DRQFR_Msk       ETH_ISR_DRQFR_Msk
#define GMAC_ISR_DRQFR           ETH_ISR_DRQFR_Msk

#define GMAC_ISR_SFR_Pos         ETH_ISR_SFR_Pos
#define GMAC_ISR_SFR_Msk         ETH_ISR_SFR_Msk
#define GMAC_ISR_SFR             ETH_ISR_SFR_Msk

#define GMAC_ISR_DRQFT_Pos       ETH_ISR_DRQFT_Pos
#define GMAC_ISR_DRQFT_Msk       ETH_ISR_DRQFT_Msk
#define GMAC_ISR_DRQFT           ETH_ISR_DRQFT_Msk

#define GMAC_ISR_SFT_Pos         ETH_ISR_SFT_Pos
#define GMAC_ISR_SFT_Msk         ETH_ISR_SFT_Msk
#define GMAC_ISR_SFT             ETH_ISR_SFT_Msk

#define GMAC_ISR_PDRQFR_Pos      ETH_ISR_PDRQFR_Pos
#define GMAC_ISR_PDRQFR_Msk      ETH_ISR_PDRQFR_Msk
#define GMAC_ISR_PDRQFR          ETH_ISR_PDRQFR_Msk

#define GMAC_ISR_PDRSFR_Pos      ETH_ISR_PDRSFR_Pos
#define GMAC_ISR_PDRSFR_Msk      ETH_ISR_PDRSFR_Msk
#define GMAC_ISR_PDRSFR          ETH_ISR_PDRSFR_Msk

#define GMAC_ISR_PDRQFT_Pos      ETH_ISR_PDRQFT_Pos
#define GMAC_ISR_PDRQFT_Msk      ETH_ISR_PDRQFT_Msk
#define GMAC_ISR_PDRQFT          ETH_ISR_PDRQFT_Msk

#define GMAC_ISR_PDRSFT_Pos      ETH_ISR_PDRSFT_Pos
#define GMAC_ISR_PDRSFT_Msk      ETH_ISR_PDRSFT_Msk
#define GMAC_ISR_PDRSFT          ETH_ISR_PDRSFT_Msk

#define GMAC_ISR_SRI_Pos         ETH_ISR_SRI_Pos
#define GMAC_ISR_SRI_Msk         ETH_ISR_SRI_Msk
#define GMAC_ISR_SRI             ETH_ISR_SRI_Msk

#define GMAC_ISR_WOL_Pos         ETH_ISR_WOL_Pos
#define GMAC_ISR_WOL_Msk         ETH_ISR_WOL_Msk
#define GMAC_ISR_WOL             ETH_ISR_WOL_Msk

#define GMAC_ISR_TSUCMP_Pos      ETH_ISR_TSUCMP_Pos
#define GMAC_ISR_TSUCMP_Msk      ETH_ISR_TSUCMP_Msk
#define GMAC_ISR_TSUCMP          ETH_ISR_TSUCMP_Msk

/* ========================================================================== */
/* IER - Interrupt Enable Register bit masks                                  */
/* ========================================================================== */
#define GMAC_IER_MFS_Pos         ETH_IER_MFS_Pos
#define GMAC_IER_MFS_Msk         ETH_IER_MFS_Msk
#define GMAC_IER_MFS             ETH_IER_MFS_Msk

#define GMAC_IER_RCOMP_Pos       ETH_IER_RCOMP_Pos
#define GMAC_IER_RCOMP_Msk       ETH_IER_RCOMP_Msk
#define GMAC_IER_RCOMP           ETH_IER_RCOMP_Msk

#define GMAC_IER_RXUBR_Pos       ETH_IER_RXUBR_Pos
#define GMAC_IER_RXUBR_Msk       ETH_IER_RXUBR_Msk
#define GMAC_IER_RXUBR           ETH_IER_RXUBR_Msk

#define GMAC_IER_TXUBR_Pos       ETH_IER_TXUBR_Pos
#define GMAC_IER_TXUBR_Msk       ETH_IER_TXUBR_Msk
#define GMAC_IER_TXUBR           ETH_IER_TXUBR_Msk

#define GMAC_IER_TUR_Pos         ETH_IER_TUR_Pos
#define GMAC_IER_TUR_Msk         ETH_IER_TUR_Msk
#define GMAC_IER_TUR             ETH_IER_TUR_Msk

#define GMAC_IER_RLEX_Pos        ETH_IER_RLEX_Pos
#define GMAC_IER_RLEX_Msk        ETH_IER_RLEX_Msk
#define GMAC_IER_RLEX            ETH_IER_RLEX_Msk

#define GMAC_IER_TFC_Pos         ETH_IER_TFC_Pos
#define GMAC_IER_TFC_Msk         ETH_IER_TFC_Msk
#define GMAC_IER_TFC             ETH_IER_TFC_Msk

#define GMAC_IER_TCOMP_Pos       ETH_IER_TCOMP_Pos
#define GMAC_IER_TCOMP_Msk       ETH_IER_TCOMP_Msk
#define GMAC_IER_TCOMP           ETH_IER_TCOMP_Msk

#define GMAC_IER_ROVR_Pos        ETH_IER_ROVR_Pos
#define GMAC_IER_ROVR_Msk        ETH_IER_ROVR_Msk
#define GMAC_IER_ROVR            ETH_IER_ROVR_Msk

#define GMAC_IER_HRESP_Pos       ETH_IER_HRESP_Pos
#define GMAC_IER_HRESP_Msk       ETH_IER_HRESP_Msk
#define GMAC_IER_HRESP           ETH_IER_HRESP_Msk

#define GMAC_IER_PFNZ_Pos        ETH_IER_PFNZ_Pos
#define GMAC_IER_PFNZ_Msk        ETH_IER_PFNZ_Msk
#define GMAC_IER_PFNZ            ETH_IER_PFNZ_Msk

#define GMAC_IER_PTZ_Pos         ETH_IER_PTZ_Pos
#define GMAC_IER_PTZ_Msk         ETH_IER_PTZ_Msk
#define GMAC_IER_PTZ             ETH_IER_PTZ_Msk

#define GMAC_IER_PFTR_Pos        ETH_IER_PFTR_Pos
#define GMAC_IER_PFTR_Msk        ETH_IER_PFTR_Msk
#define GMAC_IER_PFTR            ETH_IER_PFTR_Msk

#define GMAC_IER_EXINT_Pos       ETH_IER_EXINT_Pos
#define GMAC_IER_EXINT_Msk       ETH_IER_EXINT_Msk
#define GMAC_IER_EXINT           ETH_IER_EXINT_Msk

#define GMAC_IER_DRQFR_Pos       ETH_IER_DRQFR_Pos
#define GMAC_IER_DRQFR_Msk       ETH_IER_DRQFR_Msk
#define GMAC_IER_DRQFR           ETH_IER_DRQFR_Msk

#define GMAC_IER_SFR_Pos         ETH_IER_SFR_Pos
#define GMAC_IER_SFR_Msk         ETH_IER_SFR_Msk
#define GMAC_IER_SFR             ETH_IER_SFR_Msk

#define GMAC_IER_DRQFT_Pos       ETH_IER_DRQFT_Pos
#define GMAC_IER_DRQFT_Msk       ETH_IER_DRQFT_Msk
#define GMAC_IER_DRQFT           ETH_IER_DRQFT_Msk

#define GMAC_IER_SFT_Pos         ETH_IER_SFT_Pos
#define GMAC_IER_SFT_Msk         ETH_IER_SFT_Msk
#define GMAC_IER_SFT             ETH_IER_SFT_Msk

#define GMAC_IER_PDRQFR_Pos      ETH_IER_PDRQFR_Pos
#define GMAC_IER_PDRQFR_Msk      ETH_IER_PDRQFR_Msk
#define GMAC_IER_PDRQFR          ETH_IER_PDRQFR_Msk

#define GMAC_IER_PDRSFR_Pos      ETH_IER_PDRSFR_Pos
#define GMAC_IER_PDRSFR_Msk      ETH_IER_PDRSFR_Msk
#define GMAC_IER_PDRSFR          ETH_IER_PDRSFR_Msk

#define GMAC_IER_PDRQFT_Pos      ETH_IER_PDRQFT_Pos
#define GMAC_IER_PDRQFT_Msk      ETH_IER_PDRQFT_Msk
#define GMAC_IER_PDRQFT          ETH_IER_PDRQFT_Msk

#define GMAC_IER_PDRSFT_Pos      ETH_IER_PDRSFT_Pos
#define GMAC_IER_PDRSFT_Msk      ETH_IER_PDRSFT_Msk
#define GMAC_IER_PDRSFT          ETH_IER_PDRSFT_Msk

#define GMAC_IER_SRI_Pos         ETH_IER_SRI_Pos
#define GMAC_IER_SRI_Msk         ETH_IER_SRI_Msk
#define GMAC_IER_SRI             ETH_IER_SRI_Msk

#define GMAC_IER_WOL_Pos         ETH_IER_WOL_Pos
#define GMAC_IER_WOL_Msk         ETH_IER_WOL_Msk
#define GMAC_IER_WOL             ETH_IER_WOL_Msk

#define GMAC_IER_TSUCMP_Pos      ETH_IER_TSUCMP_Pos
#define GMAC_IER_TSUCMP_Msk      ETH_IER_TSUCMP_Msk
#define GMAC_IER_TSUCMP          ETH_IER_TSUCMP_Msk

/* ========================================================================== */
/* IDR - Interrupt Disable Register bit masks                                 */
/* ========================================================================== */
#define GMAC_IDR_MFS_Pos         ETH_IDR_MFS_Pos
#define GMAC_IDR_MFS_Msk         ETH_IDR_MFS_Msk
#define GMAC_IDR_MFS             ETH_IDR_MFS_Msk

#define GMAC_IDR_RCOMP_Pos       ETH_IDR_RCOMP_Pos
#define GMAC_IDR_RCOMP_Msk       ETH_IDR_RCOMP_Msk
#define GMAC_IDR_RCOMP           ETH_IDR_RCOMP_Msk

#define GMAC_IDR_RXUBR_Pos       ETH_IDR_RXUBR_Pos
#define GMAC_IDR_RXUBR_Msk       ETH_IDR_RXUBR_Msk
#define GMAC_IDR_RXUBR           ETH_IDR_RXUBR_Msk

#define GMAC_IDR_TXUBR_Pos       ETH_IDR_TXUBR_Pos
#define GMAC_IDR_TXUBR_Msk       ETH_IDR_TXUBR_Msk
#define GMAC_IDR_TXUBR           ETH_IDR_TXUBR_Msk

#define GMAC_IDR_TUR_Pos         ETH_IDR_TUR_Pos
#define GMAC_IDR_TUR_Msk         ETH_IDR_TUR_Msk
#define GMAC_IDR_TUR             ETH_IDR_TUR_Msk

#define GMAC_IDR_RLEX_Pos        ETH_IDR_RLEX_Pos
#define GMAC_IDR_RLEX_Msk        ETH_IDR_RLEX_Msk
#define GMAC_IDR_RLEX            ETH_IDR_RLEX_Msk

#define GMAC_IDR_TFC_Pos         ETH_IDR_TFC_Pos
#define GMAC_IDR_TFC_Msk         ETH_IDR_TFC_Msk
#define GMAC_IDR_TFC             ETH_IDR_TFC_Msk

#define GMAC_IDR_TCOMP_Pos       ETH_IDR_TCOMP_Pos
#define GMAC_IDR_TCOMP_Msk       ETH_IDR_TCOMP_Msk
#define GMAC_IDR_TCOMP           ETH_IDR_TCOMP_Msk

#define GMAC_IDR_ROVR_Pos        ETH_IDR_ROVR_Pos
#define GMAC_IDR_ROVR_Msk        ETH_IDR_ROVR_Msk
#define GMAC_IDR_ROVR            ETH_IDR_ROVR_Msk

#define GMAC_IDR_HRESP_Pos       ETH_IDR_HRESP_Pos
#define GMAC_IDR_HRESP_Msk       ETH_IDR_HRESP_Msk
#define GMAC_IDR_HRESP           ETH_IDR_HRESP_Msk

#define GMAC_IDR_PFNZ_Pos        ETH_IDR_PFNZ_Pos
#define GMAC_IDR_PFNZ_Msk        ETH_IDR_PFNZ_Msk
#define GMAC_IDR_PFNZ            ETH_IDR_PFNZ_Msk

