gcolombo-mchp/hal_microchip/packs/pic32c/pic32ck_sg_gc/common/eth_pic32ck_sg_gc.h
#define GMAC_IDR_PTZ_Pos         ETH_IDR_PTZ_Pos
#define GMAC_IDR_PTZ_Msk         ETH_IDR_PTZ_Msk
#define GMAC_IDR_PTZ             ETH_IDR_PTZ_Msk

#define GMAC_IDR_PFTR_Pos        ETH_IDR_PFTR_Pos
#define GMAC_IDR_PFTR_Msk        ETH_IDR_PFTR_Msk
#define GMAC_IDR_PFTR            ETH_IDR_PFTR_Msk

#define GMAC_IDR_EXINT_Pos       ETH_IDR_EXINT_Pos
#define GMAC_IDR_EXINT_Msk       ETH_IDR_EXINT_Msk
#define GMAC_IDR_EXINT           ETH_IDR_EXINT_Msk

#define GMAC_IDR_DRQFR_Pos       ETH_IDR_DRQFR_Pos
#define GMAC_IDR_DRQFR_Msk       ETH_IDR_DRQFR_Msk
#define GMAC_IDR_DRQFR           ETH_IDR_DRQFR_Msk

#define GMAC_IDR_SFR_Pos         ETH_IDR_SFR_Pos
#define GMAC_IDR_SFR_Msk         ETH_IDR_SFR_Msk
#define GMAC_IDR_SFR             ETH_IDR_SFR_Msk

#define GMAC_IDR_DRQFT_Pos       ETH_IDR_DRQFT_Pos
#define GMAC_IDR_DRQFT_Msk       ETH_IDR_DRQFT_Msk
#define GMAC_IDR_DRQFT           ETH_IDR_DRQFT_Msk

#define GMAC_IDR_SFT_Pos         ETH_IDR_SFT_Pos
#define GMAC_IDR_SFT_Msk         ETH_IDR_SFT_Msk
#define GMAC_IDR_SFT             ETH_IDR_SFT_Msk

#define GMAC_IDR_PDRQFR_Pos      ETH_IDR_PDRQFR_Pos
#define GMAC_IDR_PDRQFR_Msk      ETH_IDR_PDRQFR_Msk
#define GMAC_IDR_PDRQFR          ETH_IDR_PDRQFR_Msk

#define GMAC_IDR_PDRSFR_Pos      ETH_IDR_PDRSFR_Pos
#define GMAC_IDR_PDRSFR_Msk      ETH_IDR_PDRSFR_Msk
#define GMAC_IDR_PDRSFR          ETH_IDR_PDRSFR_Msk

#define GMAC_IDR_PDRQFT_Pos      ETH_IDR_PDRQFT_Pos
#define GMAC_IDR_PDRQFT_Msk      ETH_IDR_PDRQFT_Msk
#define GMAC_IDR_PDRQFT          ETH_IDR_PDRQFT_Msk

#define GMAC_IDR_PDRSFT_Pos      ETH_IDR_PDRSFT_Pos
#define GMAC_IDR_PDRSFT_Msk      ETH_IDR_PDRSFT_Msk
#define GMAC_IDR_PDRSFT          ETH_IDR_PDRSFT_Msk

#define GMAC_IDR_SRI_Pos         ETH_IDR_SRI_Pos
#define GMAC_IDR_SRI_Msk         ETH_IDR_SRI_Msk
#define GMAC_IDR_SRI             ETH_IDR_SRI_Msk

#define GMAC_IDR_WOL_Pos         ETH_IDR_WOL_Pos
#define GMAC_IDR_WOL_Msk         ETH_IDR_WOL_Msk
#define GMAC_IDR_WOL             ETH_IDR_WOL_Msk

#define GMAC_IDR_TSUCMP_Pos      ETH_IDR_TSUCMP_Pos
#define GMAC_IDR_TSUCMP_Msk      ETH_IDR_TSUCMP_Msk
#define GMAC_IDR_TSUCMP          ETH_IDR_TSUCMP_Msk

/* ========================================================================== */
/* IMR - Interrupt Mask Register bit masks                                    */
/* ========================================================================== */
#define GMAC_IMR_MFS_Pos         ETH_IMR_MFS_Pos
#define GMAC_IMR_MFS_Msk         ETH_IMR_MFS_Msk
#define GMAC_IMR_MFS             ETH_IMR_MFS_Msk

#define GMAC_IMR_RCOMP_Pos       ETH_IMR_RCOMP_Pos
#define GMAC_IMR_RCOMP_Msk       ETH_IMR_RCOMP_Msk
#define GMAC_IMR_RCOMP           ETH_IMR_RCOMP_Msk

#define GMAC_IMR_RXUBR_Pos       ETH_IMR_RXUBR_Pos
#define GMAC_IMR_RXUBR_Msk       ETH_IMR_RXUBR_Msk
#define GMAC_IMR_RXUBR           ETH_IMR_RXUBR_Msk

#define GMAC_IMR_TXUBR_Pos       ETH_IMR_TXUBR_Pos
#define GMAC_IMR_TXUBR_Msk       ETH_IMR_TXUBR_Msk
#define GMAC_IMR_TXUBR           ETH_IMR_TXUBR_Msk

#define GMAC_IMR_TUR_Pos         ETH_IMR_TUR_Pos
#define GMAC_IMR_TUR_Msk         ETH_IMR_TUR_Msk
#define GMAC_IMR_TUR             ETH_IMR_TUR_Msk

#define GMAC_IMR_RLEX_Pos        ETH_IMR_RLEX_Pos
#define GMAC_IMR_RLEX_Msk        ETH_IMR_RLEX_Msk
#define GMAC_IMR_RLEX            ETH_IMR_RLEX_Msk

#define GMAC_IMR_TFC_Pos         ETH_IMR_TFC_Pos
#define GMAC_IMR_TFC_Msk         ETH_IMR_TFC_Msk
#define GMAC_IMR_TFC             ETH_IMR_TFC_Msk

#define GMAC_IMR_TCOMP_Pos       ETH_IMR_TCOMP_Pos
#define GMAC_IMR_TCOMP_Msk       ETH_IMR_TCOMP_Msk
#define GMAC_IMR_TCOMP           ETH_IMR_TCOMP_Msk

#define GMAC_IMR_ROVR_Pos        ETH_IMR_ROVR_Pos
#define GMAC_IMR_ROVR_Msk        ETH_IMR_ROVR_Msk
#define GMAC_IMR_ROVR            ETH_IMR_ROVR_Msk

#define GMAC_IMR_HRESP_Pos       ETH_IMR_HRESP_Pos
#define GMAC_IMR_HRESP_Msk       ETH_IMR_HRESP_Msk
#define GMAC_IMR_HRESP           ETH_IMR_HRESP_Msk

#define GMAC_IMR_PFNZ_Pos        ETH_IMR_PFNZ_Pos
#define GMAC_IMR_PFNZ_Msk        ETH_IMR_PFNZ_Msk
#define GMAC_IMR_PFNZ            ETH_IMR_PFNZ_Msk

#define GMAC_IMR_PTZ_Pos         ETH_IMR_PTZ_Pos
#define GMAC_IMR_PTZ_Msk         ETH_IMR_PTZ_Msk
#define GMAC_IMR_PTZ             ETH_IMR_PTZ_Msk

#define GMAC_IMR_PFTR_Pos        ETH_IMR_PFTR_Pos
#define GMAC_IMR_PFTR_Msk        ETH_IMR_PFTR_Msk
#define GMAC_IMR_PFTR            ETH_IMR_PFTR_Msk

#define GMAC_IMR_EXINT_Pos       ETH_IMR_EXINT_Pos
#define GMAC_IMR_EXINT_Msk       ETH_IMR_EXINT_Msk
#define GMAC_IMR_EXINT           ETH_IMR_EXINT_Msk

#define GMAC_IMR_DRQFR_Pos       ETH_IMR_DRQFR_Pos
#define GMAC_IMR_DRQFR_Msk       ETH_IMR_DRQFR_Msk
#define GMAC_IMR_DRQFR           ETH_IMR_DRQFR_Msk

#define GMAC_IMR_SFR_Pos         ETH_IMR_SFR_Pos
#define GMAC_IMR_SFR_Msk         ETH_IMR_SFR_Msk
#define GMAC_IMR_SFR             ETH_IMR_SFR_Msk

#define GMAC_IMR_DRQFT_Pos       ETH_IMR_DRQFT_Pos
#define GMAC_IMR_DRQFT_Msk       ETH_IMR_DRQFT_Msk
#define GMAC_IMR_DRQFT           ETH_IMR_DRQFT_Msk

#define GMAC_IMR_SFT_Pos         ETH_IMR_SFT_Pos
#define GMAC_IMR_SFT_Msk         ETH_IMR_SFT_Msk
#define GMAC_IMR_SFT             ETH_IMR_SFT_Msk

#define GMAC_IMR_PDRQFR_Pos      ETH_IMR_PDRQFR_Pos
#define GMAC_IMR_PDRQFR_Msk      ETH_IMR_PDRQFR_Msk
#define GMAC_IMR_PDRQFR          ETH_IMR_PDRQFR_Msk

#define GMAC_IMR_PDRSFR_Pos      ETH_IMR_PDRSFR_Pos
#define GMAC_IMR_PDRSFR_Msk      ETH_IMR_PDRSFR_Msk
#define GMAC_IMR_PDRSFR          ETH_IMR_PDRSFR_Msk

#define GMAC_IMR_PDRQFT_Pos      ETH_IMR_PDRQFT_Pos
#define GMAC_IMR_PDRQFT_Msk      ETH_IMR_PDRQFT_Msk
#define GMAC_IMR_PDRQFT          ETH_IMR_PDRQFT_Msk

#define GMAC_IMR_PDRSFT_Pos      ETH_IMR_PDRSFT_Pos
#define GMAC_IMR_PDRSFT_Msk      ETH_IMR_PDRSFT_Msk
#define GMAC_IMR_PDRSFT          ETH_IMR_PDRSFT_Msk

#define GMAC_IMR_SRI_Pos         ETH_IMR_SRI_Pos
#define GMAC_IMR_SRI_Msk         ETH_IMR_SRI_Msk
#define GMAC_IMR_SRI             ETH_IMR_SRI_Msk

#define GMAC_IMR_WOL_Pos         ETH_IMR_WOL_Pos
#define GMAC_IMR_WOL_Msk         ETH_IMR_WOL_Msk
#define GMAC_IMR_WOL             ETH_IMR_WOL_Msk

