gcolombo-mchp/hal_microchip/packs/pic32c/pic32ck_sg_gc/common/eth_pic32ck_sg_gc.h
#define GMAC_IMR_TSUCMP_Pos      ETH_IMR_TSUCMP_Pos
#define GMAC_IMR_TSUCMP_Msk      ETH_IMR_TSUCMP_Msk
#define GMAC_IMR_TSUCMP          ETH_IMR_TSUCMP_Msk

/* ========================================================================== */
/* MAN - PHY Maintenance Register bit masks and function macros               */
/* ========================================================================== */
#define GMAC_MAN_DATA_Pos        ETH_MAN_DATA_Pos
#define GMAC_MAN_DATA_Msk        ETH_MAN_DATA_Msk
#define GMAC_MAN_DATA(value)     ETH_MAN_DATA(value)

#define GMAC_MAN_WTN_Pos         ETH_MAN_WTN_Pos
#define GMAC_MAN_WTN_Msk         ETH_MAN_WTN_Msk
#define GMAC_MAN_WTN(value)      ETH_MAN_WTN(value)

#define GMAC_MAN_REGA_Pos        ETH_MAN_REGA_Pos
#define GMAC_MAN_REGA_Msk        ETH_MAN_REGA_Msk
#define GMAC_MAN_REGA(value)     ETH_MAN_REGA(value)

#define GMAC_MAN_PHYA_Pos        ETH_MAN_PHYA_Pos
#define GMAC_MAN_PHYA_Msk        ETH_MAN_PHYA_Msk
#define GMAC_MAN_PHYA(value)     ETH_MAN_PHYA(value)

#define GMAC_MAN_OP_Pos          ETH_MAN_OP_Pos
#define GMAC_MAN_OP_Msk          ETH_MAN_OP_Msk
#define GMAC_MAN_OP(value)       ETH_MAN_OP(value)

#define GMAC_MAN_CLTTO_Pos       ETH_MAN_CLTTO_Pos
#define GMAC_MAN_CLTTO_Msk       ETH_MAN_CLTTO_Msk
#define GMAC_MAN_CLTTO           ETH_MAN_CLTTO_Msk

#define GMAC_MAN_WZO_Pos         ETH_MAN_WZO_Pos
#define GMAC_MAN_WZO_Msk         ETH_MAN_WZO_Msk
#define GMAC_MAN_WZO             ETH_MAN_WZO_Msk

/* ========================================================================== */
/* SAB/SAT - Specific Address bit masks                                       */
/* ========================================================================== */
#define GMAC_SAB_ADDR_Pos        ETH_SAB_ADDR_Pos
#define GMAC_SAB_ADDR_Msk        ETH_SAB_ADDR_Msk

#define GMAC_SAT_ADDR_Pos        ETH_SAT_ADDR_Pos
#define GMAC_SAT_ADDR_Msk        ETH_SAT_ADDR_Msk

/* ========================================================================== */
/* NCFGR CLK divider value macros                                             */
/* ========================================================================== */
#define GMAC_NCFGR_CLK_MCK_8    ETH_NCFGR_CLK(0)
#define GMAC_NCFGR_CLK_MCK_16   ETH_NCFGR_CLK(1)
#define GMAC_NCFGR_CLK_MCK_32   ETH_NCFGR_CLK(2)
#define GMAC_NCFGR_CLK_MCK_48   ETH_NCFGR_CLK(3)
#define GMAC_NCFGR_CLK_MCK_64   ETH_NCFGR_CLK(4)
#define GMAC_NCFGR_CLK_MCK_96   ETH_NCFGR_CLK(5)

/* ========================================================================== */
/* DCFGR FBLDO value macros                                                   */
/* ========================================================================== */
#define GMAC_DCFGR_FBLDO_SINGLE  ETH_DCFGR_FBLDO(1)
#define GMAC_DCFGR_FBLDO_INCR4   ETH_DCFGR_FBLDO(2)
#define GMAC_DCFGR_FBLDO_INCR8   ETH_DCFGR_FBLDO(3)
#define GMAC_DCFGR_FBLDO_INCR16  ETH_DCFGR_FBLDO(4)

/* ========================================================================== */
/* TPSF / RPSF register bit masks                                             */
/* ========================================================================== */
#define GMAC_TPSF_TPB1ADR_Pos    ETH_TPSF_TPB1ADR_Pos
#define GMAC_TPSF_TPB1ADR_Msk    ETH_TPSF_TPB1ADR_Msk
#define GMAC_TPSF_ENTXP_Pos      ETH_TPSF_ENTXP_Pos
#define GMAC_TPSF_ENTXP_Msk      ETH_TPSF_ENTXP_Msk
#define GMAC_TPSF_ENTXP           ETH_TPSF_ENTXP_Msk

#define GMAC_RPSF_RPB1ADR_Pos    ETH_RPSF_RPB1ADR_Pos
#define GMAC_RPSF_RPB1ADR_Msk    ETH_RPSF_RPB1ADR_Msk
#define GMAC_RPSF_ENRXP_Pos      ETH_RPSF_ENRXP_Pos
#define GMAC_RPSF_ENRXP_Msk      ETH_RPSF_ENRXP_Msk
#define GMAC_RPSF_ENRXP           ETH_RPSF_ENRXP_Msk

/* ========================================================================== */
/* RJFML register bit masks                                                   */
/* ========================================================================== */
#define GMAC_RJFML_FML_Pos       ETH_RJFML_FML_Pos
#define GMAC_RJFML_FML_Msk       ETH_RJFML_FML_Msk
#define GMAC_RJFML_FML(value)    ETH_RJFML_FML(value)

/* ========================================================================== */
/* WOL register bit masks                                                     */
/* ========================================================================== */
#define GMAC_WOL_IP_Pos          ETH_WOL_IP_Pos
#define GMAC_WOL_IP_Msk          ETH_WOL_IP_Msk
#define GMAC_WOL_MAG_Pos         ETH_WOL_MAG_Pos
#define GMAC_WOL_MAG_Msk         ETH_WOL_MAG_Msk
#define GMAC_WOL_MAG             ETH_WOL_MAG_Msk

/* ========================================================================== */
/* PIC32CK-specific: ETH CTRLA/CTRLB for peripheral enable/reset              */
/* These are additional registers not present in the SAM GMAC but needed for  */
/* PIC32CK ETH peripheral initialization.                                     */
/* ========================================================================== */
#define GMAC_CTRLA_SWRST_Pos     ETH_CTRLA_SWRST_Pos
#define GMAC_CTRLA_SWRST_Msk     ETH_CTRLA_SWRST_Msk
#define GMAC_CTRLA_SWRST         ETH_CTRLA_SWRST_Msk

#define GMAC_CTRLA_ENABLE_Pos    ETH_CTRLA_ENABLE_Pos
#define GMAC_CTRLA_ENABLE_Msk    ETH_CTRLA_ENABLE_Msk
#define GMAC_CTRLA_ENABLE        ETH_CTRLA_ENABLE_Msk

#define GMAC_CTRLB_GMIIEN_Pos    ETH_CTRLB_GMIIEN_Pos
#define GMAC_CTRLB_GMIIEN_Msk    ETH_CTRLB_GMIIEN_Msk
#define GMAC_CTRLB_GMIIEN        ETH_CTRLB_GMIIEN_Msk

#define GMAC_SYNCB_SWRST_Pos     ETH_SYNCB_SWRST_Pos
#define GMAC_SYNCB_SWRST_Msk     ETH_SYNCB_SWRST_Msk
#define GMAC_SYNCB_ENABLE_Pos    ETH_SYNCB_ENABLE_Pos
#define GMAC_SYNCB_ENABLE_Msk    ETH_SYNCB_ENABLE_Msk

#endif /* MICROCHIP_COMMON_ETH_PIC32CK_SG_GC_H_ */
